baseedt/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиента</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>String</types>
      <types>DocumentRef.СообщениеSMS</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

baseedt/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыКлиентов</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>String</types>
      <types>DocumentRef.СообщениеSMS</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

baseedt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаФотографию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

baseedt/src/CommonModules/react_Заказы/Module.bsl
Функция ПолучитьЗаказы(ЗапросHTTP) Экспорт
	
	Идентификатор = ЗапросHTTP.ПараметрыЗапроса.Получить("uuid");
	ПризнакПечати = ЗапросHTTP.ПараметрыЗапроса.Получить("print");

	ТипДокумента = "ЗаказКлиента";
	Если ЗначениеЗаполнено(Идентификатор) И НЕ ПризнакПечати Тогда
		Возврат ПолучитьЗаказПоUUID(Идентификатор, ТипДокумента)
	ИначеЕсли ЗначениеЗаполнено(Идентификатор) И ПризнакПечати Тогда
		Возврат ПолучитьПечатнуюФорму(Идентификатор, ТипДокумента)
	Иначе
		Возврат ПолучитьВсеЗаказы();
	КонецЕсли;
		
КонецФункции

Функция ПолучитьВсеЗаказы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Ссылка КАК uuid,
		|	Заказ.Номер КАК num,
		|	Заказ.Дата КАК date,
		|	Заказ.Автор.Представление КАК author,
		|	Заказ.Состояние КАК status,
		|	Заказ.Организация КАК organization,
		|	Заказ.Контрагент КАК client,
		|	Заказ.Событие КАК action,
		|	Заказ.Склад КАК warehouse
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураЗаказов = Новый Структура;
	
	МассивЗаказов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураЗаказа = Новый Структура;
		
		СтруктураЗаказа.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураЗаказа.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураЗаказа.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		
		СтруктураЗаказа.Вставить("author", Строка(ВыборкаДетальныеЗаписи.author));
		СтруктураЗаказа.Вставить("author_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		
		СтруктураЗаказа.Вставить("status", Строка(ВыборкаДетальныеЗаписи.status));
		
		СтруктураЗаказа.Вставить("organization", Строка(ВыборкаДетальныеЗаписи.organization));
		СтруктураЗаказа.Вставить("organization_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.organization));
		
		СтруктураЗаказа.Вставить("client", Строка(ВыборкаДетальныеЗаписи.client)); 
		СтруктураЗаказа.Вставить("client_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.client));
		
		СтруктураЗаказа.Вставить("action", Строка(ВыборкаДетальныеЗаписи.action));
		СтруктураЗаказа.Вставить("action_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.action));
		
		СтруктураЗаказа.Вставить("warehouse", Строка(ВыборкаДетальныеЗаписи.warehouse));
		СтруктураЗаказа.Вставить("warehouse_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.warehouse));
		
		СтруктураЗаказа.Вставить("typeBack", "ЗаказКлиента");
		СтруктураЗаказа.Вставить("type", "order");
		СтруктураЗаказа.Вставить("frontDocName", "Заказ клиента");
		
		МассивЗаказов.Добавить(СтруктураЗаказа);
	КонецЦикла;
	
	ОбщаяСтруктураЗаказов.Вставить("orders", МассивЗаказов);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураЗаказов);
	
КонецФункции

Функция ПолучитьЗаказПоUUID(uuid, ТипДокумента) Экспорт
	
	Идентификатор = Новый УникальныйИдентификатор(uuid);
	
	Ссылка = Документы[ТипДокумента].ПолучитьСсылку(Идентификатор);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	    Возврат ПолучитьДокументыЗаказКлиента(Ссылка);
	КонецЕсли;
		
КонецФункции

#Область ПолучениеДокументов

//done
Функция ПолучитьДокументыЗаказКлиента(Ссылка = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заказ.Ссылка КАК uuid,
		|	Заказ.Номер КАК num,
		|	Заказ.Дата КАК date,
		|	Заказ.Автор.Представление КАК author,
		|	Заказ.Состояние КАК status,
		|	Заказ.Организация КАК organization,
		|	Заказ.Контрагент КАК client,
		|	Заказ.Событие КАК action,
		|	Заказ.Склад КАК warehouse,
		|	Заказ.Товары.(
		|		НомерСтроки КАК id,
		|		Номенклатура КАК good,
		|		Количество КАК amount,
		|		Цена КАК price,
		|		Сумма КАК sum
		|	) КАК Товары
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказ";
		Если НЕ Ссылка = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + "	
				|ГДЕ
				|	Заказ.Ссылка = &Ссылка
				|	И НЕ Заказ.ПометкаУдаления";	
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбщаяСтруктураЗаказов = Новый Структура;
	
	МассивЗаказов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураЗаказа = Новый Структура;
		
		СтруктураЗаказа.Вставить("uuid", XMLСтрока(ВыборкаДетальныеЗаписи.uuid));
		СтруктураЗаказа.Вставить("representation", Строка(ВыборкаДетальныеЗаписи.uuid));
		
		СтруктураЗаказа.Вставить("num", ВыборкаДетальныеЗаписи.num);
		СтруктураЗаказа.Вставить("date", Формат(ВыборкаДетальныеЗаписи.date, "ДЛФ=DT"));
		
		СтруктураЗаказа.Вставить("author", Строка(ВыборкаДетальныеЗаписи.author));
		СтруктураЗаказа.Вставить("author_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.author));
		
		СтруктураЗаказа.Вставить("status", Строка(ВыборкаДетальныеЗаписи.status));
		
		СтруктураЗаказа.Вставить("organization", Строка(ВыборкаДетальныеЗаписи.organization));
		СтруктураЗаказа.Вставить("organization_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.organization));
		
		СтруктураЗаказа.Вставить("client", Строка(ВыборкаДетальныеЗаписи.client)); 
		СтруктураЗаказа.Вставить("client_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.client));
		
		СтруктураЗаказа.Вставить("action", Строка(ВыборкаДетальныеЗаписи.action));
		СтруктураЗаказа.Вставить("action_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.action));
		
		СтруктураЗаказа.Вставить("warehouse", Строка(ВыборкаДетальныеЗаписи.warehouse));
		СтруктураЗаказа.Вставить("warehouse_uuid", XMLСтрока(ВыборкаДетальныеЗаписи.warehouse));
		
		СтруктураЗаказа.Вставить("typeBack", "ЗаказКлиента");
		СтруктураЗаказа.Вставить("type", "order");
		СтруктураЗаказа.Вставить("frontDocName", "Заказ клиента");
		
		ВыборкаТовары = ВыборкаДетальныеЗаписи.Товары.Выбрать();
		
		МассивТоваров = Новый Массив;
		Пока ВыборкаТовары.Следующий() Цикл
			СтруктураТовара = Новый Структура;

			СтруктураТовара.Вставить("id", ВыборкаТовары.id);

			СтруктураТовара.Вставить("good", ВыборкаТовары.good.Наименование);		 
			СтруктураТовара.Вставить("good_uuid", XMLСтрока(ВыборкаТовары.good));

			СтруктураТовара.Вставить("amount", ВыборкаТовары.amount);
			СтруктураТовара.Вставить("price", ВыборкаТовары.price);
			СтруктураТовара.Вставить("sum", ВыборкаТовары.sum); 

			МассивТоваров.Добавить(СтруктураТовара);
		КонецЦикла;
		 
		СтруктураЗаказа.Вставить("goods", МассивТоваров);
		МассивЗаказов.Добавить(СтруктураЗаказа);
	КонецЦикла;
	
	ОбщаяСтруктураЗаказов.Вставить("orders", СтруктураЗаказа);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(ОбщаяСтруктураЗаказов);
	
КонецФункции
 
#КонецОбласти

#Область ЗаписьИСозданиеДокументов

Функция СоздатьОбновитьДокумент(Тело) Экспорт

	СтруктураТела = react_ОбщегоНазначения.ПолучитьСтруктуруИзJSON(Тело);
	
	Если СтруктураТела.typeBack = "ЗаказКлиента" Тогда
		Возврат СоздатьОбновитьДокументЗаказКлиента(СтруктураТела);
	ИначеЕсли СтруктураТела.typeBack = "РасходнаяНакладная" Тогда
		
	ИначеЕсли СтруктураТела.typeBack = "ПриходнаяНакладная" Тогда
				
	КонецЕсли;

КонецФункции

Функция СоздатьОбновитьДокументЗаказКлиента(СтруктураТела)
	
	Если НЕ ЗначениеЗаполнено(СтруктураТела.uuid) Тогда
		Объект = Документы.Встреча.СоздатьДокумент();
	Иначе
		УникальныйИдентификатор = Новый УникальныйИдентификатор(СтруктураТела.uuid);
		Объект = Документы.Встреча.ПолучитьСсылку(УникальныйИдентификатор).ПолучитьОбъект();
	КонецЕсли;
	
	Объект.Дата 					= Дата(СтруктураТела.date);
	Объект.Автор 					= Справочники.Пользователи.НайтиПоНаименованию(СтруктураТела.author);
	Объект.Важность 				= react_ОбщегоНазначения.ПолучитьСсылкуНаВариантВажности(СтруктураТела.importance);
	Объект.ДатаНачала 				= Дата(СтруктураТела.date_beginning);
	Объект.ДатаОкончания 			= Дата(СтруктураТела.date_ending);
	Объект.МестоПроведенияВстречи 	= СтруктураТела.meeting_place;
	Объект.Описание 				= СтруктураТела.description;
	Объект.Ответственный 			= Справочники.Пользователи.НайтиПоНаименованию(СтруктураТела.responsible);
	
	ТипДокументаОснование 			= react_ОбщегоНазначения.ПолучитьТипВзаимодействияПоПредставлению(СтруктураТела.actions_basis_representation);
	Объект.ВзаимодействиеОснование 	= Документы[ТипДокументаОснование].ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураТела.actions_basis));
	
	Объект.Тема 					= СтруктураТела.theme;
	Объект.Комментарий 				= СтруктураТела.comment;
	
	Ответ = Новый Структура("status, error");
	КодСтатус = 500;
	Попытка
		Объект.Записать();
		
		КодСтатус = 200;
		Ответ.status = "success";
		Ответ.error = "no error";
	Исключение
		КодСтатус = 500;
		Ответ.status = "failed";
		Ответ.error = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Новый Структура("Тело, Код", react_ОбщегоНазначения.МассивСтруктурВJSON(Ответ), КодСтатус);
	
КонецФункции

#КонецОбласти

#Область Печать

Функция ПолучитьПечатнуюФорму(uuid, ТипДокумента) Экспорт
	
	Идентификатор = Новый УникальныйИдентификатор(uuid);
	
	Ссылка = Документы[ТипДокумента].ПолучитьСсылку(Идентификатор);
	
	//временно
	СсылкаНаНакладную = Документы.РасходнаяНакладная.НайтиПоРеквизиту("ЗаказКлиента", Ссылка);
	ТабличныйДокумент = Документы.РасходнаяНакладная.СформироватьРасходнуюНакладную(СсылкаНаНакладную);
	
	//выравнивание по ширине
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РА";

	BASEСтрока = ТабличныйДокументВСтроку(ТабличныйДокумент);
	
	СтруктураОтвета = Новый Структура("pdf_base64", BASEСтрока);
	
	Возврат react_ОбщегоНазначения.МассивСтруктурВJSON(СтруктураОтвета);
		
КонецФункции

Функция ТабличныйДокументВСтроку(ТабличныйДокумент) Экспорт
		
			
	ИмяФайла = ПолучитьИмяВременногоФайла("PDF");
	
	
	ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
		
	Данные = Новый ДвоичныеДанные(ИмяФайла);
	
	
	BASEСтрока = Base64Строка(Данные);
	
	
	ТабличныйДокумент = Неопределено;
	
	
	УдалитьФайлы(ИмяФайла);
	
	
	Возврат BASEСтрока;
			
	
КонецФункции

#КонецОбласти
